export interface PriceData {
    [key: string]: number;
}

export const cakePrices: PriceData = {
    Сникерс: 2000,
    'Вишневый ломтик': 2000,
    Ферреро: 2200,
    'Капитан Куки': 2200,
    'Фисташка-Малина': 2000,
    'Молочная девочка': 1900,
    'Ягодное облако': 1800,
    'Красный бархат': 1700,
    'Пряная морковь': 1800,
    МакЛимон: 1700,
};

export const bentoPrices: PriceData = {
    Сникерс: 1400,
    'Красный бархат / Клубника': 1400,
    'Красный бархат / Манго-Маракуйя': 1400,
    МакЛимон: 1400,
    'Ваниль / Клубника': 1400,
    'Ваниль / Малина': 1400,
    'Вишневый ломтик': 1400,
};

export const eskimoPrices: PriceData = {
    'Вишневый ломтик': 250,
    'Ваниль / Малина': 250,
    'Ваниль / Клубника': 250,
    'Красный бархат / Клубника': 250,
    'Красный бархат / Манго-Маракуйя': 250,
    МакЛимон: 250,
    Сникерс: 250,
};

export const cakePopsPrices: PriceData = {
    Мак: 150,
    Ваниль: 150,
    Шоколад: 150,
};

export const dessertPrices: PriceData = {
    'Шоколадный комбо': 200,
    'Шоколадная вишня': 200,
    'Лимон-Малина': 200,
    'Пряная морковь': 200,
    Сникерс: 250,
    'Вишневый ломтик': 250,
    МакЛимон: 250,
    'Ваниль-Малина': 250,
    'Ваниль-Клубника': 250,
};
